In [1]:
import pandas as pd

In [5]:
clients = pd.read_csv("../data/clients.csv")
orders = pd.read_csv("../data/orders.csv")

clients.rename(columns={
  "cliente_id": "client_id",
  "nombre": "name",
  "pais": "country"
}, inplace=True)

orders.rename(columns={
  "pedido_id": "order_id",
  "cliente_id": "client_id",
  "producto": "product",
  "monto": "amount"
}, inplace=True)

In [6]:
pd.merge(clients, orders, on="client_id", how="inner")

   client_id    name    country  order_id  product  amount
0          1     Ana  Argentina       101   Laptop    1200
1          2  Carlos      Chile       102    Mouse      25
2          2  Carlos      Chile       103  Teclado      80
3          3   Lucía  Argentina       104  Monitor     300

In [8]:
pd.merge(clients, orders, on="client_id", how="right")

   client_id    name    country  order_id      product  amount
0          1     Ana  Argentina       101       Laptop    1200
1          2  Carlos      Chile       102        Mouse      25
2          2  Carlos      Chile       103      Teclado      80
3          3   Lucía  Argentina       104      Monitor     300
4          6     NaN        NaN       105  Auriculares      60

In [ ]:
# Alternativa simple: anti-join con isin
no_orders_isin = clients.loc[~clients["client_id"].isin(orders["client_id"]), ["client_id", "name", "country"]]
no_orders_isin